Revit 2027 API
BuiltInFailures.StairRampFailures.BadRailProfile Property
 One or more Profile Loops are invalid, probably because of self-intersection.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId BadRailProfile { get; }
Public Shared ReadOnly Property BadRailProfile As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ BadRailProfile {
	FailureDefinitionId^ get ();
}
static member BadRailProfile : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace